[
  {
    "question": "Is ethics a checklist?",
    "selectedAnswers": [
      "False"
    ]
  },
  {
    "question": "What is moral responsibility?",
    "selectedAnswers": [
      "It means to be accountable for our actions and the effects of these actions"
    ]
  },
  {
    "question": "Moral responsibility is based on: (Select multiple answers)",
    "selectedAnswers": [
      "obligations and norms arising from moral considerations",
      "moral duties"
    ]
  },
  {
    "question": "Is Passive Responsibility a form of backward-looking responsibility?",
    "selectedAnswers": [
      "True"
    ]
  },
  {
    "question": "Which are the elements that play a key role in assessing responsibility? (Select multiple answers)",
    "selectedAnswers": [
      "Accountability",
      "Blameworthiness"
    ]
  },
  {
    "question": "What is foreseeability?",
    "selectedAnswers": [
      "To be able to know the consequences of action"
    ]
  },
  {
    "question": "Active responsibility means... (Select multiple answers)",
    "selectedAnswers": [
      "to prevent the negative effects of technology",
      "to realize some positive consequences of technology"
    ]
  },
  {
    "question": "Is Value Sensitive Design a form of active responsibility?",
    "selectedAnswers": [
      "True"
    ]
  },
  {
    "question": "What is utilitarianism? (Select multiple answers)",
    "selectedAnswers": [
      "A type of consequentialism, where decisions and actions are evaluated as morally good or bad according to the consequences they bring about",
      "An ethical framework based on the utility principle"
    ]
  },
  {
    "question": "What is utilitarianism? (Select muliple answers).",
    "selectedAnswers": [
      "A type of consequentialism, where decisions and actions are evaluated as morally good or bad according to the consequences they bring about",
      "An ethical framework based on the utility principle"
    ]
  },
  {
    "question": "Is duty ethics a framework in which an action is considered morally right if it agrees with a certain moral rule?",
    "selectedAnswers": [
      "True"
    ]
  },
  {
    "question": "What does it mean that a weapon system is autonomous?",
    "selectedAnswers": [
      "It means that it has navigation, exploration and attack capabilities and does not require continuous human supervision"
    ]
  },
  {
    "question": "What is meaningful human control? (Select multiple answers)",
    "selectedAnswers": [
      "The type of control for which the human controller must have enough information and time to intervene on the autonomous systems",
      "A concept proposed in the last years as a necessary condition for the responsible employment of autonomous weapon systems"
    ]
  },
  {
    "question": "Digital health and digital medicine have mainly four areas of application",
    "selectedAnswers": [
      "True"
    ]
  },
  {
    "question": "To establish the sustainability of digital services, it is important...",
    "selectedAnswers": [
      "to consider both the numerical value of their environmental impact and their social value"
    ]
  },
  {
    "question": "What is the goal of cybersecurity?",
    "selectedAnswers": [
      "To guarantee the confidentiality, integrity, and availability of information"
    ]
  },
  {
    "question": "What does HTML stand for?",
    "selectedAnswers": [
      "Hypertext Markup Language"
    ],
    "inputAnswer": null
  },
  {
    "question": "When you open a webpage in Chrome it may look slightly different if opened in a different browser.  ",
    "selectedAnswers": [
      "True"
    ],
    "inputAnswer": null
  },
  {
    "question": "Read this question carefully since we are asking about things we want to avoid.  HTML5 should **NOT**...",
    "selectedAnswers": [
      "take advantage of the most up-to-date plugins."
    ],
    "inputAnswer": null
  },
  {
    "question": "Which of the following best explains the difference between syntax and semantics?",
    "selectedAnswers": [
      "A browser may have trouble displaying a page if the syntax is incorrect."
    ],
    "inputAnswer": null
  },
  {
    "question": "W3C stands for:",
    "selectedAnswers": [
      "World Wide Web Consortium"
    ],
    "inputAnswer": null
  },
  {
    "question": "The creation of HTML5 was a cooperation between many parties. Which of the following was NOT part of that cooperation?",
    "selectedAnswers": [
      "DARPA"
    ],
    "inputAnswer": null
  },
  {
    "question": "What does HTTP stand for?",
    "selectedAnswers": [
      "No answer selected"
    ],
    "inputAnswer": "Hypertext Transfer Protocol"
  },
  {
    "question": "Which of the following is part of a URL?",
    "selectedAnswers": [
      "domain (or host) and protocol"
    ],
    "inputAnswer": null
  },
  {
    "question": "Which of the following is an example of a top-level domain?",
    "selectedAnswers": [
      ".biz"
    ],
    "inputAnswer": null
  },
  {
    "question": "The Domain Name Service looks up the domain and returns the:",
    "selectedAnswers": [
      "IP address"
    ],
    "inputAnswer": null
  },
  {
    "question": "Which organization is responsible for assigning top-level domain names?",
    "selectedAnswers": [
      "Internet Corporation for Assigned Numbers and Names (ICANN)"
    ],
    "inputAnswer": null
  },
  {
    "question": "What does LAN stand for?",
    "selectedAnswers": [
      "No answer selected"
    ],
    "inputAnswer": "Local Area Network"
  },
  {
    "question": "A ________________________ is a computer that is in charge of handling resource requests from multiple computers.",
    "selectedAnswers": [
      "No answer selected"
    ],
    "inputAnswer": "Server"
  },
  {
    "question": "A single web page may require several iterations of the Request-Response Cycle.",
    "selectedAnswers": [
      "True"
    ],
    "inputAnswer": null
  },
  {
    "question": "HTML uses _________ to annotate documents. This is a way of marking up the content to identify specific HTML elements.",
    "selectedAnswers": [
      "No answer selected"
    ],
    "inputAnswer": "tags"
  },
  {
    "question": "The original developers of HTML were opposed to the addition of tags for graphical images.",
    "selectedAnswers": [
      "True"
    ],
    "inputAnswer": null
  },
  {
    "question": "The first graphical browser was.... (please use one word answer)",
    "selectedAnswers": [
      "No answer selected"
    ],
    "inputAnswer": "Mosaic"
  },
  {
    "question": "What are proprietary tags?",
    "selectedAnswers": [
      "Tags that work only on certain browsers"
    ],
    "inputAnswer": null
  },
  {
    "question": "Which of these tags breaks the tenet of the separation of content and layout?",
    "selectedAnswers": [
      "font"
    ],
    "inputAnswer": null
  },
  {
    "question": "Which of the following are browsers?",
    "selectedAnswers": [
      "Chrome, Firefox, Safari"
    ],
    "inputAnswer": null
  },
  {
    "question": "A basic functionality of browsers is to translate HTML documents into viewable webpages.",
    "selectedAnswers": [
      "True"
    ],
    "inputAnswer": null
  },
  {
    "question": "Which version of HTML introduced semantic tags?",
    "selectedAnswers": [
      "HTML 5"
    ],
    "inputAnswer": null
  },
  {
    "question": "Which of the editors below has the most built-in functionality for creating .html files?",
    "selectedAnswers": [
      "Sublime"
    ],
    "inputAnswer": null
  },
  {
    "question": "Which of the following is an Integrated Development Environment?",
    "selectedAnswers": [
      "Replit"
    ],
    "inputAnswer": null
  },
  {
    "question": "Which of the following should you avoid when naming your files ?",
    "selectedAnswers": [
      "Using any numbers in a file name."
    ],
    "inputAnswer": null
  },
  {
    "question": "What editor are you using?",
    "selectedAnswers": [
      "No answer selected"
    ],
    "inputAnswer": "Good"
  },
  {
    "question": "What browser(s) are you using?",
    "selectedAnswers": [
      "No answer selected"
    ],
    "inputAnswer": "Good"
  },
  {
    "question": "Which of the following are the basic elements of an organisation, as discussed by the instructor?",
    "selectedAnswers": [
      "Structure, systems, culture, people practices"
    ],
    "inputAnswer": null
  },
  {
    "question": "Which of the following best captures a key element of business strategy?",
    "selectedAnswers": [
      "What customer segments you are targeting"
    ],
    "inputAnswer": null
  },
  {
    "question": "Which of the following are the reasons that make key capabilies so important? Choose all that apply.",
    "selectedAnswers": [
      "They help focus the organisation on what it needs to be really good at to succeed with its strategy.",
      "They can form the basis of sustainable competitive advantage.",
      "They help focus leaders by enabling them to prioritize what issues are most important."
    ],
    "inputAnswer": null
  },
  {
    "question": "The instructor suggests using Porter's frameworks, when identifying key capabilities, for which of the following purposes?",
    "selectedAnswers": [
      "To go through the key value-adding activities in your organization in a systematic way."
    ],
    "inputAnswer": null
  },
  {
    "question": "Which of the following is a myth around the use of the Porter's value chain framework?",
    "selectedAnswers": [
      "It’s only appropriate for analyzing manufacturing firms."
    ],
    "inputAnswer": null
  },
  {
    "question": "The operations process in the Porter's value chain framework is defined as_____________.",
    "selectedAnswers": [
      "The activity of transforming raw materials into finished goods."
    ],
    "inputAnswer": null
  },
  {
    "question": "Which one of the following is classified as a primary activity in a value chain?",
    "selectedAnswers": [
      "Marketing and sales"
    ],
    "inputAnswer": null
  },
  {
    "question": "According to the instructor, which of the following value chain activity is considered important for a consulting firm?",
    "selectedAnswers": [
      "HRM"
    ],
    "inputAnswer": null
  },
  {
    "question": "Which one of the following is classified as a secondary activity in a value chain?",
    "selectedAnswers": [
      "HRM"
    ],
    "inputAnswer": null
  },
  {
    "question": "According to the instructor, how can we ensure that our organisation can deliver on its strategy, while at the same time remaining sufficiently agile?",
    "selectedAnswers": [
      "Break the organization down into its main elements and align those elements with key capabilities"
    ],
    "inputAnswer": null
  }
]