[
  {
    "question": "Is ethics a checklist?",
    "selectedAnswers": [
      "False"
    ]
  },
  {
    "question": "What is moral responsibility?",
    "selectedAnswers": [
      "It means to be accountable for our actions and the effects of these actions"
    ]
  },
  {
    "question": "Moral responsibility is based on: (Select multiple answers)",
    "selectedAnswers": [
      "obligations and norms arising from moral considerations",
      "moral duties"
    ]
  },
  {
    "question": "Is Passive Responsibility a form of backward-looking responsibility?",
    "selectedAnswers": [
      "True"
    ]
  },
  {
    "question": "Which are the elements that play a key role in assessing responsibility? (Select multiple answers)",
    "selectedAnswers": [
      "Accountability",
      "Blameworthiness"
    ]
  },
  {
    "question": "What is foreseeability?",
    "selectedAnswers": [
      "To be able to know the consequences of action"
    ]
  },
  {
    "question": "Active responsibility means... (Select multiple answers)",
    "selectedAnswers": [
      "to prevent the negative effects of technology",
      "to realize some positive consequences of technology"
    ]
  },
  {
    "question": "Is Value Sensitive Design a form of active responsibility?",
    "selectedAnswers": [
      "True"
    ]
  },
  {
    "question": "What is utilitarianism? (Select multiple answers)",
    "selectedAnswers": [
      "A type of consequentialism, where decisions and actions are evaluated as morally good or bad according to the consequences they bring about",
      "An ethical framework based on the utility principle"
    ]
  },
  {
    "question": "Is duty ethics a framework in which an action is considered morally right if it agrees with a certain moral rule?",
    "selectedAnswers": [
      "True"
    ]
  },
  {
    "question": "What does it mean that a weapon system is autonomous?",
    "selectedAnswers": [
      "It means that it has navigation, exploration and attack capabilities and does not require continuous human supervision"
    ]
  },
  {
    "question": "What is meaningful human control? (Select multiple answers)",
    "selectedAnswers": [
      "The type of control for which the human controller must have enough information and time to intervene on the autonomous systems",
      "A concept proposed in the last years as a necessary condition for the responsible employment of autonomous weapon systems"
    ]
  },
  {
    "question": "Digital health and digital medicine have mainly four areas of application",
    "selectedAnswers": [
      "True"
    ]
  },
  {
    "question": "To establish the sustainability of digital services, it is important...",
    "selectedAnswers": [
      "to consider both the numerical value of their environmental impact and their social value"
    ]
  },
  {
    "question": "What is the goal of cybersecurity?",
    "selectedAnswers": [
      "To guarantee the confidentiality, integrity, and availability of information"
    ]
  }
]